DocumentJournals/ПрослеживаемостьУведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DocumentJournal>
		<Properties>
			<Name>ПрослеживаемостьУведомления</Name>
			<RegisteredDocuments>
				<xr:Item>Document.УведомлениеОбОстаткахПрослеживаемыхТоваров</xr:Item>
				<xr:Item>Document.УведомлениеОВвозеПрослеживаемыхТоваров</xr:Item>
				<xr:Item>Document.УведомлениеОПеремещенииПрослеживаемыхТоваров</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.УведомлениеОбОстаткахПрослеживаемыхТоваров.Attribute.Организация</xr:Item>
						<xr:Item>Document.УведомлениеОВвозеПрослеживаемыхТоваров.Attribute.Организация</xr:Item>
						<xr:Item>Document.УведомлениеОПеремещенииПрослеживаемыхТоваров.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ТНВЭД</Name>
					<References>
						<xr:Item>Document.УведомлениеОбОстаткахПрослеживаемыхТоваров.Attribute.КодТНВЭД</xr:Item>
						<xr:Item>Document.УведомлениеОВвозеПрослеживаемыхТоваров.Attribute.КодТНВЭД</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<References>
						<xr:Item>Document.УведомлениеОбОстаткахПрослеживаемыхТоваров.Attribute.ПервичныйДокумент</xr:Item>
						<xr:Item>Document.УведомлениеОВвозеПрослеживаемыхТоваров.Attribute.ПервичныйДокумент</xr:Item>
						<xr:Item>Document.УведомлениеОПеремещенииПрослеживаемыхТоваров.Attribute.ПервичныйДокумент</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РНПТ</Name>
					<References>
						<xr:Item>Document.УведомлениеОбОстаткахПрослеживаемыхТоваров.Attribute.РНПТ</xr:Item>
						<xr:Item>Document.УведомлениеОВвозеПрослеживаемыхТоваров.Attribute.РНПТ</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДокументУведомление</Name>
					<References>
						<xr:Item>Document.УведомлениеОбОстаткахПрослеживаемыхТоваров.Attribute.ДокументУведомлениеОбОстатках</xr:Item>
						<xr:Item>Document.УведомлениеОВвозеПрослеживаемыхТоваров.Attribute.ДокументУведомлениеОВвозе</xr:Item>
						<xr:Item>Document.УведомлениеОПеремещенииПрослеживаемыхТоваров.Attribute.ДокументУведомлениеОПеремещении</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НомерКорректировки</Name>
					<References>
						<xr:Item>Document.УведомлениеОбОстаткахПрослеживаемыхТоваров.Attribute.НомерКорректировки</xr:Item>
						<xr:Item>Document.УведомлениеОВвозеПрослеживаемыхТоваров.Attribute.НомерКорректировки</xr:Item>
						<xr:Item>Document.УведомлениеОПеремещенииПрослеживаемыхТоваров.Attribute.НомерКорректировки</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.УведомлениеОбОстаткахПрослеживаемыхТоваров.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.УведомлениеОВвозеПрослеживаемыхТоваров.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.УведомлениеОПеремещенииПрослеживаемыхТоваров.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.УведомлениеОбОстаткахПрослеживаемыхТоваров.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.УведомлениеОВвозеПрослеживаемыхТоваров.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.УведомлениеОПеремещенииПрослеживаемыхТоваров.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Основание</Name>
					<References>
						<xr:Item>Document.УведомлениеОВвозеПрослеживаемыхТоваров.Attribute.ОснованиеКорректировки</xr:Item>
						<xr:Item>Document.УведомлениеОбОстаткахПрослеживаемыхТоваров.Attribute.ПервичныйДокумент</xr:Item>
						<xr:Item>Document.УведомлениеОПеремещенииПрослеживаемыхТоваров.Attribute.ПервичныйДокумент</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

Documents/УведомлениеОВвозеПрослеживаемыхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УведомлениеОВвозеПрослеживаемыхТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрослеживаемыеТовары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РНПТ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РНПТ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомленияОВвозе</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Склад</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентПрослеживаемость</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПрослеживаемости</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭДПослеИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияПослеИзменения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПрослеживаемостиПослеИзменения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2Корректировочный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2КорректировочныйПослеИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУведомлениеОВвозе</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОВвозеПрослеживаемыхТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоПодтверждениеИзФНС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФормыРеорганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННДоРеорганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППДоРеорганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеКорректировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомленияОВвозе</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОКПД2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрослеживаемости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПослеИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрослеживаемостиПослеИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПослеИзменения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхожденияПослеИзменения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DocumentJournals/ПрослеживаемостьУведомления/Forms/ФормаСпискаБП/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
	ОтборОрганизация = ОсновнаяОрганизация;
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
	УстановитьУсловноеОформление();
	
	ЭтоПростойИнтерфейс = ОбщегоНазначенияБП.ЭтоПростойИнтерфейс();
	Элементы.ГруппаПомощник.Видимость = ЭтоПростойИнтерфейс;
	Элементы.ГруппаОтчеты.Видимость = ЭтоПростойИнтерфейс;
	Элементы.ОтчетАнализРНПТДокументовКомандаАнализРНПТДокументов.Видимость = ПроверкаРНПТ.ПроверкаРНПТВключена();
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров);
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактировать;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОсновнаяОрганизация = Параметр;
		Если ОсновнаяОрганизация <> ОтборОрганизация Тогда
			ОтборОрганизация = ОсновнаяОрганизация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
			ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ВидыОпераций = ВидыОперацийУведомлений(Строки.ПолучитьКлючи());
	
	Для Каждого ТекущаяСтрока Из Строки Цикл
		
		Данные = ТекущаяСтрока.Значение.Данные;
		НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер, Истина, Ложь);
		ПредставлениеТипДокумента = НСтр("ru = 'Уведомление'");
		Если Данные.НомерКорректировки > 0 Тогда
			ПредставлениеТипДокумента = НСтр("ru = 'Корректировочное уведомление'");
			Данные.ПредставлениеНомер = ТекстНомераПреставленияКорректировки(НомерНаПечать, Данные.НомерКорректировки);
		Иначе
			Данные.ПредставлениеНомер = НомерНаПечать;
		КонецЕсли;
		
		Данные.ПредставлениеДата = Формат(Данные.Дата, "ДФ=dd.MM.yyyy");
		
		ТекстОкончаниеДокумента = "";
		Если ТипЗНЧ(Данные.Ссылка) = Тип("ДокументСсылка.УведомлениеОбОстаткахПрослеживаемыхТоваров") Тогда
			ВидОперации = ВидыОпераций.Получить(Данные.Ссылка);
			Если ВидОперации = Перечисления.ВидыОперацийУведомленияОбОстаткахПрослеживаемыхОбъектов.ОсновныеСредства Тогда
				ТекстОкончаниеДокумента = НСтр("ru='об остатках ОС'");
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийУведомленияОбОстаткахПрослеживаемыхОбъектов.КомплектующиеОС Тогда
				ТекстОкончаниеДокумента = НСтр("ru='об остатках комплектующих ОС'");
			Иначе
				ТекстОкончаниеДокумента = НСтр("ru='об остатках'");
			КонецЕсли;
		ИначеЕсли ТипЗНЧ(Данные.Ссылка) = Тип("ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров") Тогда
			ТекстОкончаниеДокумента = НСтр("ru = 'о ввозе'");
		Иначе
			ТекстОкончаниеДокумента = НСтр("ru = 'о перемещении'");
		КонецЕсли;
		
		Данные.ПредставлениеТипДокумента = СтрШаблон("%1 %2", ПредставлениеТипДокумента, ТекстОкончаниеДокумента); 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьКорректировочноеУведомлениеКонтекстноеМеню(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияИспользования",
		?(ПустаяСтрока(КлючНазначенияИспользования), "Уведомления", КлючНазначенияИспользования));
	
		Если ТекущиеДанные <> Неопределено Тогда
			
			ПараметрыФормы.Вставить("Основание", ТекущиеДанные.Ссылка);
			
			Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.УведомлениеОбОстаткахПрослеживаемыхТоваров") Тогда
			
				ОткрытьФорму("Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Форма.ФормаДокументаКорректировочная", 
					ПараметрыФормы);
				
			ИначеЕсли ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.УведомлениеОВвозеПрослеживаемыхТоваров") Тогда
				
				ОткрытьФорму("Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Форма.ФормаДокументаКорректировочная", 
					ПараметрыФормы);
				
			Иначе
				
				ОткрытьФорму("Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Форма.ФормаДокументаКорректировочная", 
					ПараметрыФормы);
				
			КонецЕсли;
			
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомлениеОбОстаткахПрослеживаемыхТоваров(Команда)
	
	СтруктураПараметров = 
		ПараметрыФормыДокумента(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУведомленияОбОстаткахПрослеживаемыхОбъектов.Товары"));
	
	ОткрытьФорму("Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Форма.ФормаДокументаОсновная",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомлениеОВвозеПрослеживаемыхТоваров(Команда)
	
	СтруктураПараметров = ПараметрыФормыДокумента();
	ОткрытьФорму("Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Форма.ФормаДокументаОсновная",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомлениеОбОстаткахПрослеживаемыхСоставныхОС(Команда)

	СтруктураПараметров = 
		ПараметрыФормыДокумента(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУведомленияОбОстаткахПрослеживаемыхОбъектов.КомплектующиеОС"));
	
	ОткрытьФорму("Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Форма.ФормаДокументаОсновная",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомлениеОбОстаткахПрослеживаемыхОС(Команда)

	СтруктураПараметров = 
		ПараметрыФормыДокумента(
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУведомленияОбОстаткахПрослеживаемыхОбъектов.ОсновныеСредства"));
	
	ОткрытьФорму("Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Форма.ФормаДокументаОсновная",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУведомлениеОПеремещенииПрослеживаемыхТоваров(Команда)
	
	СтруктураПараметров = ПараметрыФормыДокумента();
	ОткрытьФорму("Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Форма.ФормаДокументаОсновная",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникПолученияРНПТ(Команда)
	
	СтруктураПараметров = Новый Структура;
	Если ОтборОрганизацияИспользование Тогда
		СтруктураПараметров.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	ОткрытьФорму("Обработка.ПомощникПолученияРНПТ.Форма", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировочноеУведомлениеОбОстатках(Команда)
	
	СтруктураПараметров = ПараметрыФормыПодбораКорректировки();
	ОткрытьФорму("Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров.Форма.ФормаПодбора",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировочноеУведомлениеОВвозе(Команда)
	
	СтруктураПараметров = ПараметрыФормыПодбораКорректировки();
	ОткрытьФорму("Документ.УведомлениеОВвозеПрослеживаемыхТоваров.Форма.ФормаПодбора",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировочноеУведомлениеОПеремещении(Команда)
	
	СтруктураПараметров = ПараметрыФормыПодбораКорректировки();
	ОткрытьФорму("Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.Форма.ФормаПодбора",
		СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПараметрыФормыДокумента(ВидОперации = Неопределено)
	
	ЗначенияЗаполнения = Новый Структура;
	
	Если ЗначениеЗаполнено(ВидОперации) Тогда
		ЗначенияЗаполнения.Вставить("ВидОперации", ВидОперации);
	КонецЕсли;
	
	Если ОтборОрганизацияИспользование Тогда
		ЗначенияЗаполнения.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Функция ПараметрыФормыПодбораКорректировки()
	
	Отбор = Новый Структура;
	
	Если ОтборОрганизацияИспользование Тогда
		Отбор.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("Отбор", Отбор);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстНомераПреставленияКорректировки(Номер, НомерКорректировки)
	
	НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Истина, Ложь);
	ТекстНомера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 (корр. %2)'"),
		НомерНаПечать, 
		НомерКорректировки);
		
	Возврат ТекстНомера;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	// Состояние
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Состояние");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Список.Состояние", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не отправлено'"));
	
	// Организация
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Организация");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборОрганизацияИспользование", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборОрганизация", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидыОперацийУведомлений(Уведомления)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка,
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.ВидОперации
	|ИЗ
	|	Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров КАК УведомлениеОбОстаткахПрослеживаемыхТоваров
	|ГДЕ
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка В (&Уведомления)";
	Запрос.УстановитьПараметр("Уведомления", Уведомления);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ссылка, Выборка.ВидОперации);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
